[M_Ep1_Champion MissionDefinition]
MissionDescription="After Handsome Jack left you for dead in [place]Windshear Waste[-place], you escaped the cold and met a CL4P-TP steward bot -- the last of his kind on Pandora. He has invited you into his igloo."
TurnInDescription="You just moved five feet and opened a locker. Later, when you're killing skyscraper-sized monsters with a gun that shoots lightning, you'll look back on this moment and be like, ''heh.''"

[M_Ep1_Champion:OpenLockerSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="After Handsome Jack left you for dead in [place]Windshear Waste[-place], you escaped the cold and met a CL4P-TP steward bot -- the last of his kind on Pandora. Shortly after you entered Claptrap's igloo, an enormous bullymong broke in and removed Claptrap's eye. Claptrap needs your help to get it back. First things first, though: you need a gun. Claptrap has asked you to grab one from his cabinet."
